<a href="https://colab.research.google.com/github/tata2351/My-Jupyter-Notebooke/blob/main/Lesson_7_Untitled23.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

--task1  (lesson7)
-- sqlite3: Перенести таблицы pc, printer, product & laptop в локальную sqlite3 (те сделать снэпшот этих таблиц из postgreSQL в sqlite3 через python).

In [2]:
import sqlite3
conn_sqlite = sqlite3.connect('TestDB_new.db')  



import psycopg2
import pandas as pd

#!введите свои реквизиты!
DB_HOST = '52.157.159.24'
DB_USER = 'student23'
DB_USER_PASSWORD = 'student23_password'
DB_NAME = 'sql_ex_third_stream'

conn_psql = psycopg2.connect(host=DB_HOST, user=DB_USER, password=DB_USER_PASSWORD, dbname=DB_NAME)


# df = pd.read_sql('select * from laptop', conn_psql)

# df.to_sql(name='laptop', con=conn_sqlite)

# pd.read_sql('select * from laptop', conn_sqlite)

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

--task2  (lesson7)
-- sqlite3: сравнить скорость обработки таблиц sqlite3 vs postgresql на примере запроса: посчитать количество всех товаров стоимостью больше 500. (через %%time перед запросом в ноутбуке)

In [3]:
df = pd.read_sql('select * from pc', conn_psql)

df.to_sql(name='pc', con=conn_sqlite)




df = pd.read_sql('select * from printer', conn_psql)

df.to_sql(name='printer', con=conn_sqlite)





df = pd.read_sql('select * from product', conn_psql)

df.to_sql(name='product', con=conn_sqlite)

In [ ]:
%%time 
pd.read_sql('select * from laptop', conn_sqlite)

CPU times: user 3.05 ms, sys: 850 µs, total: 3.9 ms
Wall time: 5.53 ms

   index  code model  speed  ram    hd   price  screen
0      0     1  1298    350   32   4.0   700.0      11
1      1     2  1321    500   64   8.0   970.0      12
2      2     3  1750    750  128  12.0  1200.0      14
3      3     4  1298    600   64  10.0  1050.0      15
4      4     5  1752    750  128  10.0  1150.0      14
5      5     6  1298    450   64  10.0   950.0      12

In [4]:
%%time 
pd.read_sql('select * from laptop', conn_psql)

CPU times: user 4.54 ms, sys: 89 µs, total: 4.63 ms
Wall time: 10.4 ms

   code model  speed  ram    hd   price  screen
0     1  1298    350   32   4.0   700.0      11
1     2  1321    500   64   8.0   970.0      12
2     3  1750    750  128  12.0  1200.0      14
3     4  1298    600   64  10.0  1050.0      15
4     5  1752    750  128  10.0  1150.0      14
5     6  1298    450   64  10.0   950.0      12

 NO sql

In [5]:
import sys
!{sys.executable} -m pip install sqlitedict

Collecting sqlitedict
  Downloading sqlitedict-1.7.0.tar.gz (28 kB)
Building wheels for collected packages: sqlitedict
  Building wheel for sqlitedict (setup.py) ... done
  Created wheel for sqlitedict: filename=sqlitedict-1.7.0-py3-none-any.whl size=14392 sha256=566e1c32f3e1540743482e3fe881cc55de908cb415a9b3385370021605e2db41
  Stored in directory: /root/.cache/pip/wheels/af/94/06/18c0e83e9e227da8f3582810b51f319bbfd181e508676a56c8
Successfully built sqlitedict
Installing collected packages: sqlitedict
Successfully installed sqlitedict-1.7.0

In [6]:
import sqlitedict
import pandas as pd

In [7]:
from sqlitedict import SqliteDict
mydict = SqliteDict('TestDB_key_value.sqlite', autocommit=True)

In [8]:
mydict['key1'] = 'value1'
mydict['key2'] = ['123',123]
mydict['key3'] = pd.DataFrame()
mydict.commit()
# mydict.close()

In [9]:
mydict['lesson2_2'] = 'select * from pc'
mydict.commit()

In [10]:
print(mydict['key1'])
print(mydict['key2'])
print(mydict['key3'])

value1
['123', 123]
Empty DataFrame
Columns: []
Index: []

--task4 (lesson7)
-- sqlitedict: загрузите любую вашу домашнюю работу (через скрипт) в таблицу (test table). Ключ: lesson2_2, Значение: sql запрос

In [11]:
mydict['lesson2_2'] = 'select * from pc'
mydict.commit()

In [ ]:
print(mydict['lesson2_2'])

In [ ]:
## Nosql документная база данных

In [13]:
!{sys.executable} -m pip install tinydb

Collecting tinydb
  Downloading tinydb-4.5.2-py3-none-any.whl (23 kB)
Requirement already satisfied: typing-extensions<4.0.0,>=3.10.0 in /usr/local/lib/python3.7/dist-packages (from tinydb) (3.10.0.2)
Installing collected packages: tinydb
Successfully installed tinydb-4.5.2

In [14]:
from tinydb import TinyDB, Query

In [15]:
from tinydb import TinyDB, Query
db = TinyDB('db.json')
db.insert({'int': 1, 'char': 'a'})
db.insert({'int': 1, 'char': 'b'})

2

In [16]:
User = Query()
db.search(User.char == 'a')

[{'char': 'a', 'int': 1}]

In [ ]:
##task5 (lesson7)
## sqlitedict: загрузите все домашние работы в формате json в таблицу test table.  Ключ: lesson2_2, Значение: sql запрос

In [17]:
from tinydb import TinyDB, Query
db = TinyDB('db.json')
db.insert({'lesson': 1, 'exercise': 2, 'sql': 'select * from pc'})


User = Query()
db.search(User.lesson == 1)

[{'exercise': 2, 'lesson': 1, 'sql': 'select * from pc'}]

--task1  (lesson6, дополнительно)
-- SQL: Создайте таблицу с синтетическими данными (10000 строк, 3 колонки, все типы int) и заполните ее случайными данными от 0 до 1 000 000. Проведите EXPLAIN операции и сравните базовые операции.

In [18]:
df = pd.read_sql('''
with recursive generate_series(r1,r2,r3) as (
    select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    union all select abs(random() % 1000000) as r1, abs(random() % 1000000) as r2, abs(random() % 1000000) as r3
    from generate_series
    limit 10000)
select * from generate_series;
''', conn_sqlite)